# Titanic Survival Challenge

## Import libraries

In [4]:
import pandas as pd 
print("pandas version: {}". format(pd.__version__))

pandas version: 1.1.3

In [15]:
import matplotlib as m
print("matplotlib version: {}". format(matplotlib.__version__))

matplotlib version: 3.3.2

In [6]:
import numpy as np 
print("NumPy version: {}". format(np.__version__))

NumPy version: 1.19.2

In [7]:
import scipy as sp 
print("SciPy version: {}". format(sp.__version__))

SciPy version: 1.5.2

In [16]:
import IPython
from IPython import display 
print("IPython version: {}". format(IPython.__version__))

IPython version: 7.19.0

In [9]:
import sklearn 
print("scikit-learn version: {}". format(sklearn.__version__))

scikit-learn version: 0.23.2

In [11]:
import random

In [26]:
import time

import os

#ignore warnings
import warnings
warnings.filterwarnings('ignore')

**************************************************

In [ ]:
# change current directory 

os.chdir("C:/Users/nutsa/Documents")

In [47]:
# importing train dataset with survivale labels as labelled dataset
data_labelled = pd.read_csv('Projects/titanic/datasets/train.csv') 

# importing test dataset without survivale labels as unlabelled dataset
data_unlabelled =  pd.read_csv('Projects/titanic/datasets/test.csv')

**Cleaning operations:**
* missing value handling
* variable type conversion
* dropping any unimportant features for the analysis

In [34]:
data_labelled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [37]:
# get header of the dataframe
data_labelled.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [38]:
# get 5 random rows as an example
df01.sample(n = 5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
842,843,1,1,"Serepeca, Miss. Augusta",female,30.0,0,0,113798,31.000,NaN,C
695,696,0,2,"Chapman, Mr. Charles Henry",male,52.0,0,0,248731,13.500,NaN,S
204,205,1,3,"Cohen, Mr. Gurshon ""Gus""",male,18.0,0,0,A/5 3540,8.050,NaN,S
119,120,0,3,"Andersson, Miss. Ellis Anna Maria",female,2.0,4,2,347082,31.275,NaN,S
857,858,1,1,"Daly, Mr. Peter Denis",male,51.0,0,0,113055,26.550,E17,S

In [52]:
data_labelled.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [56]:
data_unlabelled.dtypes

PassengerId      int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [83]:
data_labelled.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [60]:
data_unlabelled.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

Check **duplicate values**

In [95]:
doubles = data_labelled.duplicated(subset = ["Name"], keep = False)

doubles_unlabelled = data_unlabelled.duplicated(subset = ["Name"], keep = False)

print(doubles.sum())
print(doubles_unlabelled.sum())

0
0

Check **missing values**

In [97]:
data_labelled.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [99]:
data_unlabelled.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In labelled data the column _Embarked_ has some missing values wereas in unlabelled dataset there is one missing value in the feature _Fare_.  _Age_ and _Cabin_ have missing values in both datasets. In addition, _Cabin_ feature is mostly missing, I'm going to drop it from the analysis along with _passenger and Ticket identifier columns_.

For the start, categorical missing values is going to be imputed with _mode_. As for numeric values - _median_ Imput median _Age_ per each class (?)

In [101]:
#group by class to check the difference among age
data_labelled.groupby(by = "Pclass").agg({"Age" : "median"})

         Age
Pclass
1       37.0
2       29.0
3       24.0

**Convert** variable classes strings / objects --> category

In [89]:
# only for train dataset
data_labelled["Survived"] = data_labelled["Survived"].astype("category")

#conversion for the whole dataset
col_names = ["Pclass", "Sex", "Embarked"]

for i in range(len(col_names)):
    column = col_names[i] 
    
    data_labelled[column] = data_labelled[column].astype("category") 
    data_unlabelled[column] = data_unlabelled[column].astype("category")

In [87]:
data_labelled["Survived"].describe()

count     891
unique      2
top         0
freq      549
Name: Survived, dtype: int64

In [90]:
data_labelled["Embarked"].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

         Age
Pclass
1       37.0
2       29.0
3       24.0